apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_i2s.c
/* Internal buffer must be aligned to the bytes_per_sample. Sometimes,
 * however, the audio buffer is not aligned and additional bytes must
 * be copied to be inserted on the next buffer. This structure keeps
 * track of the bytes that were not written to the internal buffer yet.
 */

struct esp32s2_buffer_carry_s
{
  uint32_t value;
  size_t bytes;
};

/* This structure describes the state of one receiver or transmitter
 * transport.
 */

struct esp32s2_transport_s
{
  sq_queue_t pend;              /* A queue of pending transfers */
  sq_queue_t act;               /* A queue of active transfers */
  sq_queue_t done;              /* A queue of completed transfers */
  struct work_s work;           /* Supports worker thread operations */

  /* Bytes to be written at the beginning of the next DMA buffer */

  struct esp32s2_buffer_carry_s carry;
};

/* The state of the one I2S peripheral */

struct esp32s2_i2s_s
{
  struct i2s_dev_s  dev;        /* Externally visible I2S interface */
  mutex_t           lock;       /* Ensures mutually exclusive access */
  int               cpuint;     /* I2S interrupt ID */
  uint8_t           cpu;        /* CPU ID */

  /* Port configuration */

  const struct esp32s2_i2s_config_s *config;

  uint32_t    mclk_freq;      /* I2S actual master clock */
  uint32_t    mclk_multiple;  /* The multiple of mclk to the sample rate */
  uint32_t    channels;       /* Audio channels (1:mono or 2:stereo) */
  uint32_t    rate;           /* I2S actual configured sample-rate */
  uint32_t    data_width;     /* I2S actual configured data_width */

#ifdef I2S_HAVE_TX
  struct esp32s2_transport_s tx;  /* TX transport state */

  bool tx_started;              /* TX channel started */
#endif /* I2S_HAVE_TX */

#ifdef I2S_HAVE_RX
  struct esp32s2_transport_s rx;  /* RX transport state */

  bool rx_started;              /* RX channel started */
#endif /* I2S_HAVE_RX */

  /* Pre-allocated pool of buffer containers */

  sem_t bufsem;                         /* Buffer wait semaphore */
  struct esp32s2_buffer_s *bf_freelist; /* A list a free buffer containers */
  struct esp32s2_buffer_s containers[CONFIG_ESP32S2_I2S_MAXINFLIGHT];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register helpers */

#ifdef CONFIG_ESP32S2_I2S_DUMPBUFFERS
#  define       i2s_dump_buffer(m,b,s) lib_dumpbuffer(m,b,s)
#else
#  define       i2s_dump_buffer(m,b,s)
#endif

/* Buffer container helpers */

static struct esp32s2_buffer_s *
                i2s_buf_allocate(struct esp32s2_i2s_s *priv);
static void     i2s_buf_free(struct esp32s2_i2s_s *priv,
                             struct esp32s2_buffer_s *bfcontainer);
static int      i2s_buf_initialize(struct esp32s2_i2s_s *priv);

/* DMA support */

#ifdef I2S_HAVE_TX
static int  i2s_txdma_setup(struct esp32s2_i2s_s *priv,
                            struct esp32s2_buffer_s *bfcontainer);
static void i2s_tx_worker(void *arg);
static void i2s_tx_schedule(struct esp32s2_i2s_s *priv,
                            struct esp32s2_dmadesc_s *outlink);
#endif /* I2S_HAVE_TX */

#ifdef I2S_HAVE_RX
static int  i2s_rxdma_setup(struct esp32s2_i2s_s *priv,
                            struct esp32s2_buffer_s *bfcontainer);
static void i2s_rx_worker(void *arg);
static void i2s_rx_schedule(struct esp32s2_i2s_s *priv,
                            struct esp32s2_dmadesc_s *outlink);
#endif /* I2S_HAVE_RX */

/* I2S methods (and close friends) */

static uint32_t i2s_set_datawidth(struct esp32s2_i2s_s *priv);
static uint32_t i2s_set_clock(struct esp32s2_i2s_s *priv);
static int32_t  i2s_getmclkfrequency(struct i2s_dev_s *dev);
static int32_t  i2s_setmclkfrequency(struct i2s_dev_s *dev,
                                     uint32_t frequency);
static int      i2s_ioctl(struct i2s_dev_s *dev, int cmd, unsigned long arg);

#ifdef I2S_HAVE_TX
static void     i2s_tx_channel_start(struct esp32s2_i2s_s *priv);
static void     i2s_tx_channel_stop(struct esp32s2_i2s_s *priv);
static int      i2s_txchannels(struct i2s_dev_s *dev, uint8_t channels);
static int32_t  i2s_txsamplerate(struct i2s_dev_s *dev, uint32_t rate);
static int32_t  i2s_txdatawidth(struct i2s_dev_s *dev, int bits);
static int      i2s_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                         i2s_callback_t callback, void *arg,
                         uint32_t timeout);
#endif /* I2S_HAVE_TX */

#ifdef I2S_HAVE_RX
static void     i2s_rx_channel_start(struct esp32s2_i2s_s *priv);
static void     i2s_rx_channel_stop(struct esp32s2_i2s_s *priv);
static int      i2s_rxchannels(struct i2s_dev_s *dev, uint8_t channels);
static int32_t  i2s_rxsamplerate(struct i2s_dev_s *dev, uint32_t rate);
static int32_t  i2s_rxdatawidth(struct i2s_dev_s *dev, int bits);
static int      i2s_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                            i2s_callback_t callback, void *arg,
                            uint32_t timeout);
#endif /* I2S_HAVE_RX */

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct i2s_ops_s g_i2sops =
{
#ifdef I2S_HAVE_TX
  .i2s_txchannels     = i2s_txchannels,
  .i2s_txsamplerate   = i2s_txsamplerate,
  .i2s_txdatawidth    = i2s_txdatawidth,
  .i2s_send           = i2s_send,
#endif /* I2S_HAVE_TX */

#ifdef I2S_HAVE_RX
  .i2s_rxchannels     = i2s_rxchannels,
  .i2s_rxsamplerate   = i2s_rxsamplerate,
  .i2s_rxdatawidth    = i2s_rxdatawidth,
  .i2s_receive        = i2s_receive,
#endif /* I2S_HAVE_RX */

  .i2s_ioctl          = i2s_ioctl,
  .i2s_getmclkfrequency  = i2s_getmclkfrequency,
  .i2s_setmclkfrequency  = i2s_setmclkfrequency,
};

#ifdef CONFIG_ESP32S2_I2S
static const struct esp32s2_i2s_config_s esp32s2_i2s0_config =
{
  .port             = 0,
#ifdef CONFIG_ESP32S2_I2S_ROLE_MASTER
  .role             = I2S_ROLE_MASTER,
#else
  .role             = I2S_ROLE_SLAVE,
#endif /* CONFIG_ESP32S2_I2S_ROLE_MASTER */
  .data_width       = CONFIG_ESP32S2_I2S_DATA_BIT_WIDTH,
  .rate             = CONFIG_ESP32S2_I2S_SAMPLE_RATE,
  .total_slot       = 2,
  .tx_en            = I2S_TX_ENABLED,
  .rx_en            = I2S_RX_ENABLED,
#ifdef CONFIG_ESP32S2_I2S_MCLK
  .mclk_pin         = CONFIG_ESP32S2_I2S_MCLKPIN,
#else
  .mclk_pin         = I2S_GPIO_UNUSED,
#endif /* CONFIG_ESP32S2_I2S_MCLK */
  .bclk_pin         = CONFIG_ESP32S2_I2S_BCLKPIN,
  .ws_pin           = CONFIG_ESP32S2_I2S_WSPIN,
#ifdef CONFIG_ESP32S2_I2S_DOUTPIN
  .dout_pin         = CONFIG_ESP32S2_I2S_DOUTPIN,
#else
  .dout_pin         = I2S_GPIO_UNUSED,
#endif /* CONFIG_ESP32S2_I2S_DOUTPIN */
#ifdef CONFIG_ESP32S2_I2S_DINPIN
  .din_pin          = CONFIG_ESP32S2_I2S_DINPIN,
#else
  .din_pin          = I2S_GPIO_UNUSED,
#endif /* CONFIG_ESP32S2_I2S_DINPIN */
  .periph           = ESP32S2_PERIPH_I2S0,
  .irq              = ESP32S2_IRQ_I2S0,
  .bclk_in_insig    = I2S0I_BCK_IN_IDX,
  .bclk_in_outsig   = I2S0I_BCK_OUT_IDX,
  .bclk_out_insig   = I2S0O_BCK_IN_IDX,
  .bclk_out_outsig  = I2S0O_BCK_OUT_IDX,
  .ws_in_insig      = I2S0I_WS_IN_IDX,
  .ws_in_outsig     = I2S0I_WS_OUT_IDX,
  .ws_out_insig     = I2S0O_WS_IN_IDX,
  .ws_out_outsig    = I2S0O_WS_OUT_IDX,
  .din_insig        = I2S0I_DATA_IN15_IDX,
  .dout_outsig      = I2S0O_DATA_OUT23_IDX,
  .mclk_out_sig     = CLK_I2S_MUX_IDX,
  .bit_shift        = true,
  .mono_en          = false,
  .ws_width         = CONFIG_ESP32S2_I2S_DATA_BIT_WIDTH,
};

static struct esp32s2_i2s_s esp32s2_i2s0_priv =
{
  .dev =
  {
    .ops = &g_i2sops
  },
  .lock = NXMUTEX_INITIALIZER,
  .config = &esp32s2_i2s0_config,
  .bufsem = SEM_INITIALIZER(0)
};
#endif /* CONFIG_ESP32S2_I2S */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: i2s_buf_allocate
 *
 * Description:
 *   Allocate a buffer container by removing the one at the head of the
 *   free list
 *
 * Input Parameters:
 *   priv - Initialized I2S device structure.
 *
 * Returned Value:
 *   A non-NULL pointer to the allocate buffer container on success; NULL if
 *   there are no available buffer containers.
 *
 * Assumptions:
 *   The caller does NOT have exclusive access to the I2S state structure.
 *   That would result in a deadlock!
 *
 ****************************************************************************/

static struct esp32s2_buffer_s *i2s_buf_allocate(struct esp32s2_i2s_s *priv)
{
  struct esp32s2_buffer_s *bfcontainer;
  irqstate_t flags;
  int ret;

