apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_i2s.c
  putreg32(UINT32_MAX, I2S_INT_CLR_REG);

  /* Set up to receive peripheral interrupts on the current CPU.
   * With ARCH_MINIMAL_VECTORTABLE, the handler must be passed directly
   * to esp_setup_irq() so it gets stored in the HAL's interrupt table.
   */

  priv->cpu = this_cpu();
  priv->cpuint = esp_setup_irq(priv->config->periph, 1,
                               ESP_IRQ_TRIGGER_LEVEL,
                               i2s_interrupt, priv);
  if (priv->cpuint < 0)
    {
      i2serr("Failed to allocate a CPU interrupt.\n");
      return priv->cpuint;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32s2_i2sbus_initialize
 *
 * Description:
 *   Initialize the I2S peripheral
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Valid I2S device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct i2s_dev_s *esp32s2_i2sbus_initialize(void)
{
  int ret;
  struct esp32s2_i2s_s *priv = NULL;
  irqstate_t flags;

  /* Statically allocated I2S' device structure */

  priv = &esp32s2_i2s0_priv;

  flags = enter_critical_section();

  i2s_configure(priv);

  /* Allocate buffer containers */

  ret = i2s_buf_initialize(priv);
  if (ret < 0)
    {
      goto err;
    }

  ret = i2s_dma_setup(priv);
  if (ret < 0)
    {
      goto err;
    }

#ifdef I2S_HAVE_TX
  /* Start TX channel */

  if (priv->config->tx_en)
    {
      priv->tx_started = false;
      i2s_tx_channel_start(priv);
    }
#endif /* I2S_HAVE_TX */

#ifdef I2S_HAVE_RX
  /* Start RX channel */

  if (priv->config->rx_en)
    {
      priv->rx_started = false;
      i2s_rx_channel_start(priv);
    }
#endif /* I2S_HAVE_RX */

  leave_critical_section(flags);

  /* Success exit */

  i2sinfo("I2S0 was successfully initialized\n");

  return &priv->dev;

  /* Failure exit */

err:
  leave_critical_section(flags);
  return NULL;
}

#endif /* CONFIG_ESP32S2_I2S */
